// метод на введение трехзначного числа!!!
// int GetNumberThreeDigit()
// {
//     int num = 0;
//     while (num < 99 || num > 1000)
//     {
//         Console.WriteLine("Введите трехзначное число: ");
//         num = Convert.ToInt32(Console.ReadLine());
//     }
//     return num;
// }
// int a = GetNumberThreeDigit();
// Console.WriteLine(a);

// написать программу, которая получает число А и находит сумму чисел до этого числа.
 